{"last_request_date": "2024-11-28", "data": {"success": true, "credits_left": 18, "rate_limit_left": 18, "person": {"publicIdentifier": "ferranterico", "linkedInIdentifier": "ACoAAC6gItoBSHg0_W3j-xURHSaV7z3mfAwc5kc", "memberIdentifier": "782246618", "linkedInUrl": "https://www.linkedin.com/in/ferranterico", "firstName": "Federico", "lastName": "F.", "headline": "Passionate Full-Stack Developer with proven expertise in delivering custom web solutions, enhancing user experiences, optimizing performance, and collaborating on innovative projects.", "location": "Ottawa, Ontario, Canada", "summary": "I’m a passionate web developer with over a decade of experience in design, development, and delivering creative solutions for clients worldwide. My journey started at just 12 years old, teaching myself web development and design, and I’ve never stopped learning and growing since.\n\nAt 15, I started freelancing, where I specialized in fixing, customizing, and optimizing WordPress sites. From creating child themes and plugins to enhancing loading speed and solving complex technical issues, I’ve gained deep expertise in HTML5, CSS3, JavaScript, jQuery, PHP, MySQL, and WHM/cPanel. Working closely with clients, I quickly learned the importance of clear communication and understanding client needs—skills that have shaped the way I approach every project.\n\nBy 19, I partnered with Just One Dime, a global coaching company for eCommerce sellers, where I developed and launched eCommerce websites for their clients. This role helped me refine my ability to work one-on-one with clients, solving problems and delivering results that aligned with their business goals. The positive feedback from these clients has been a testament to my dedication to creating value, which you can see reflected in the recommendations on my profile.\n\nAt 22, I took on the challenge of leading a design team at Victoria eCom, a fast-paced company focused on branding and online retail. Leading the design process for over 600 product assets, including packaging and manuals, I honed my leadership, teamwork, and attention-to-detail. Managing multiple projects simultaneously taught me the importance of clear communication and maintaining structure from start to finish.\n\nIn 2022, I embarked on a new chapter by immigrating to Canada and enrolling in the IT Programmer-Analyst program at New Brunswick Community College. Here, I deepened my knowledge of object-oriented programming, systems analysis and design, project management, entrepreneurship, Linux, and Amazon Web Services (AWS). I've learned how applications work from the ground up using three-tier architecture, which has been a great complement to my web development skills.\n\nNow, I’m excited to bring my years of experience, technical knowledge, and passion for web development to the Canadian job market. I’m eager to contribute, learn, and grow as part of a dynamic team. I’m confident that my blend of freelancing, team leadership, and recent studies make me a strong asset in any project or organization.", "photoUrl": "https://media.licdn.com/dms/image/v2/D4D03AQEn_M-0Yro3bg/profile-displayphoto-shrink_800_800/profile-displayphoto-shrink_800_800/0/1704891725774?e=1738195200&v=beta&t=aughlad3VLsMxYvC1oH1uThfQW9j3u9ZzMz6FlzevUU", "backgroundUrl": null, "openToWork": true, "premium": true, "pronoun": "HE_HIM", "showVerificationBadge": true, "creationDate": {"month": 12, "year": 2019}, "followerCount": 201, "positions": {"positionsCount": 9, "positionHistory": [{"title": "Wordpress Developer", "companyName": "Hydrostor", "companyLocation": "Toronto, Ontario, Canada · Remote", "description": "-Conduct thorough reviews of existing audits and execute recommended improvements.\n-Enhance and update website content to ensure alignment with brand identity and messaging.\n-Design and implement new web pages and templates to support content such as blogs, whitepapers, and event listings.\n-Establish and configure SEO monitoring tools to optimize website visibility and performance.\n-Integrate newsletter functionalities to facilitate audience engagement and outreach.\n-Optimize user experience by conducting usability tests and analyzing user behavior to make data-driven improvements.\n-Implement performance enhancements by utilizing tools like Google PageSpeed Insights to resolve speed and performance issues.\n-Collaborate on content strategy with marketing and content teams to align website messaging and visual elements with brand guidelines.\n-Maintain cross-browser and device compatibility by ensuring web pages are optimized across multiple devices and browsers.\n-Monitor and manage backlinks using SEO tools to track and identify opportunities for strengthening domain authority and organic reach.\n-Update and manage CMS (WordPress) to perform regular updates to plugins, ensuring compatibility, security, and performance.\n-Track and report on key metrics by generating monthly performance reports that detail SEO, traffic, and user engagement insights to support continuous optimization.", "startEndDate": {"start": {"month": 7, "year": 2024}, "end": null}, "contractType": "Freelance", "companyLogo": "https://media.licdn.com/dms/image/v2/C560BAQHP2AaWV4wWhg/company-logo_400_400/company-logo_400_400/0/1630668157561/hydrostor_inc__logo?e=1741219200&v=beta&t=lOuVZfYKTcDUtKCU8xSAzLL2vs55Dt934hHa6GRnt_I", "linkedInUrl": "https://www.linkedin.com/company/8420149/", "linkedInId": "8420149"}, {"title": "Full Stack Developer", "companyName": "Spandrel Interactive", "description": "- Development of web applications and websites.\n- Back end, databases.\n- Front end development and customisations to Web platforms and sites.\n- Administer cloud infrastructure.\n- Participate in planning and strategy with development leads.\n- Participate in scrum and project direction planning.\n- Assist in development and maintenance of customizations, plugins, modules,\nand applications to enhance the functionality of the base platform.\n- Collaborate with cross-functional teams to integrate third-party tools.\n- Troubleshoot and resolve technical issues related to custom web services.\n- Collaborate with cross-functional teams to identify opportunities for process\nimprovements and system enhancements.", "startEndDate": {"start": {"month": 6, "year": 2024}, "end": null}, "companyLogo": "https://media.licdn.com/dms/image/v2/C4E0BAQGL4_JbOnmOhw/company-logo_400_400/company-logo_400_400/0/1630613832816/spandrel_interactive_logo?e=1741219200&v=beta&t=iPGg7wOyAs4hnmSayyj4l3b4TXX3yhGPi85DCIfQcuI", "linkedInUrl": "https://www.linkedin.com/company/71103324/", "linkedInId": "71103324"}, {"title": "Web Development Intern", "companyName": "Spandrel Interactive", "description": "-Web Design using WebFlow, CSS, JavaScript, Photoshop and Figma\n-Web Development using JavaScript, jQuery, PHP, MySQL, AWS, Git and Moodle.", "startEndDate": {"start": {"month": 4, "year": 2024}, "end": {"month": 6, "year": 2024}}, "companyLogo": "https://media.licdn.com/dms/image/v2/C4E0BAQGL4_JbOnmOhw/company-logo_400_400/company-logo_400_400/0/1630613832816/spandrel_interactive_logo?e=1741219200&v=beta&t=iPGg7wOyAs4hnmSayyj4l3b4TXX3yhGPi85DCIfQcuI", "linkedInUrl": "https://www.linkedin.com/company/71103324/", "linkedInId": "71103324"}, {"title": "WordPress Web Designer & Developer", "companyName": "Self-employed", "companyLocation": "Mar del Plata, Buenos Aires Province, Argentina · Remote", "description": "eCommerce Stores development for companies needing online presence, website optimization, tech assistance, and maintenance.\n\n-WordPress Themes Modification and Development\n-PHP Snippets\n-MySQL Databases\n-UI Design\n-Bug Fixes\n-Landing Pages Development\n-Funnels Automation\n-Payment Gateways", "startEndDate": {"start": {"month": 9, "year": 2013}, "end": {"month": 1, "year": 2024}}, "companyLogo": null, "linkedInUrl": "https://www.linkedin.com/search/results/all/?keywords=Aut%C3%B3nomo"}, {"title": "WordPress Content Proofreader", "companyName": "Gospel on the Web", "companyLocation": "Fredericton, New Brunswick, Canada · Remote", "description": "I did content proofreading in WordPress for an entire website this summer. I had to proofread the Italian website of the project and worked on more than 80 pages. I have used my Italian, WordPress, Photoshop, HTML and CSS skills to do my job.", "startEndDate": {"start": {"month": 6, "year": 2023}, "end": {"month": 9, "year": 2023}}, "contractType": "Seasonal", "companyLogo": null, "linkedInUrl": "https://www.linkedin.com/search/results/all/?keywords=Gospel+on+the+Web"}, {"title": "Design Team Leader", "companyName": "Victoria eCom", "companyLocation": "Miami, Florida, United States · Remote", "description": "We source, differentiate, import and sell products in the United States.\n\nI'm responsible for the Design Department.\n\nWe create the package, manual, sticker and listing of each product we manage.\n\nMy commitment to the team is to guarantee a minimalistic, user-centred and detailed design that will make the product sell by itself once the customer sees the images (on the listing) or the package.", "startEndDate": {"start": {"month": 8, "year": 2021}, "end": {"month": 2, "year": 2023}}, "contractType": "Contract Full-time", "companyLogo": "https://media.licdn.com/dms/image/v2/C560BAQHW2bGqLcbYoA/company-logo_400_400/company-logo_400_400/0/1671232128770?e=1741219200&v=beta&t=nS0jMQ3m7iMqtspeqNPEVGMipCYnbfuVl-yUcoUr_AE", "linkedInUrl": "https://www.linkedin.com/company/89908929/", "linkedInId": "89908929"}, {"title": "Server Maintenance, Billing & Tech Support", "companyName": "Just One Dime", "description": "Server Maintenance (WHM), Billing & Tech Support (Email and WHMCS).", "startEndDate": {"start": {"month": 11, "year": 2017}, "end": {"month": 11, "year": 2022}}, "companyLogo": "https://media.licdn.com/dms/image/v2/C4E0BAQFvonPQxw414w/company-logo_400_400/company-logo_400_400/0/1630603005555/justonedime_logo?e=1741219200&v=beta&t=xriCEfiHxcJjPK8n3e4w8HnIsTpQOf4kmV5jz4CzkqQ", "linkedInUrl": "https://www.linkedin.com/company/35449089/", "linkedInId": "35449089"}, {"title": "Wordpress Developer", "companyName": "Just One Dime", "description": "WordPress + WooCommerce Stores Development for Amazon Sellers, Customer Care and Tech Support.", "startEndDate": {"start": {"month": 8, "year": 2017}, "end": {"month": 2, "year": 2020}}, "companyLogo": "https://media.licdn.com/dms/image/v2/C4E0BAQFvonPQxw414w/company-logo_400_400/company-logo_400_400/0/1630603005555/justonedime_logo?e=1741219200&v=beta&t=xriCEfiHxcJjPK8n3e4w8HnIsTpQOf4kmV5jz4CzkqQ", "linkedInUrl": "https://www.linkedin.com/company/35449089/", "linkedInId": "35449089"}, {"title": "WordPress Developer and Community Manager", "companyName": "Aeroclub Mar del Plata", "companyLocation": "Mar del Plata, Buenos Aires Province, Argentina · Hybrid", "description": "Community Management and Online Advertisement.\n\n-Facebook and Instagram Campaigns Creation\n-Landing Pages\n-Public Segmentation\n-Facebook and Instagram Posts and Stories\n-Customer Care Assistance\n-Brand Image Development\n-WordPress Website Development", "startEndDate": {"start": {"month": 3, "year": 2018}, "end": {"month": 1, "year": 2022}}, "contractType": "Permanent Part-time", "companyLogo": "https://media.licdn.com/dms/image/v2/C4D0BAQFQzaOQHwiUiA/company-logo_400_400/company-logo_400_400/0/1630537245354?e=1741219200&v=beta&t=HBeiYJcOV5Ne0b6-qLtjUrqHB9RxGbpZZPY9kwwu2y8", "linkedInUrl": "https://www.linkedin.com/company/34942459/", "linkedInId": "34942459"}]}, "schools": {"educationsCount": 2, "educationHistory": [{"degreeName": "Post-Secondary (2 Years), IT Programmer - Analyst", "fieldOfStudy": "Post-Secondary (2 Years), IT Programmer - Analyst", "linkedInUrl": "https://www.linkedin.com/company/15142665/", "schoolLogo": "https://media.licdn.com/dms/image/v2/D4D0BAQH1VIqltWSwvw/company-logo_400_400/company-logo_400_400/0/1729008190494?e=1741219200&v=beta&t=wVhXE-QfNFU8jqKyuEuU1bNbPGVvg4JMBPDwvc3Dm6M", "schoolName": "NBCC (New Brunswick Community College)", "startEndDate": {"start": {"month": 9, "year": 2022}, "end": {"month": 6, "year": 2024}}}, {"degreeName": "IT Courses", "fieldOfStudy": "IT Courses", "description": "-JavaScript + PHP and MySQL\n-Search Engine Optimization (SEO)\n-Linux\n-JAVA SE\n-Adobe Dreamweaver CS4\n-Adobe Flash CS4\n-Adobe Photoshop CS5", "linkedInUrl": "https://www.linkedin.com/company/920408/", "schoolLogo": "https://media.licdn.com/dms/image/v2/D4D0BAQFIz05EBkoopg/company-logo_400_400/company-logo_400_400/0/1666275085296/lasiglo21_logo?e=1741219200&v=beta&t=ILPZv42WYXew34ZxvOMwAywxU7Ai-qXccOrx6rVY_S0", "schoolName": "Universidad Empresarial 'Siglo 21'​", "startEndDate": {"start": {"month": 1, "year": 2010}, "end": {"month": 1, "year": 2013}}}]}, "skills": ["Copywriting", "Payment Gateways", "MercadoPago", "Web Development", "Automation", "Process Automation", "Stripe (Software)", "Zapier", "Application Programming Interfaces (API)", "Figma (Software)", "Adobe Illustrator", "Bitbucket", "Linux System Administration", "Content Management Systems (CMS)", "Adobe Creative Suite", "Email Marketing", "Branding & Identity", "Linux Network Administration", "Scrum", "Laravel", "MariaDB", "Linux", "User Experience (UX)", "jQuery", "Docker", "Amazon Web Services (AWS)", "Git", "Moodle", "User Interface Design", "Webflow", "Search Engine Optimization (SEO)", "Front-End Development", "Software Development", "Responsive Web Design", "Object-Oriented Programming (OOP)", "Marketing Automation", "JavaScript", "Teamwork", "Landing Pages", "Sales Funnels"], "languages": ["English", "French", "Italian", "Spanish"], "recommendations": {"recommendationsCount": 5, "recommendationHistory": [{"caption": "November 12, 2024, Jeff managed Federico directly", "description": "I have had the pleasure of working with Rico as a Web Developer on our dev team at Spandrel Interactive. Rico is exceptionally reliable, versatile, and a quick learner. As the main developer on some of our most important web projects, he consistently delivered high-quality work efficiently and effectively. His wide breadth of experience allowed him to collaborate seamlessly with our full team, including very experienced senior developers.\n\nRico is a strong developer and would be a valuable addition to any development team. His dedication, skill set, and positive attitude make him stand out. I sincerely hope to have the opportunity to work with him again in the future.", "authorFullname": "Jeff Mundee", "authorUrl": "https://www.linkedin.com/in/jeffmundee"}, {"caption": "October 21, 2024, Will managed Federico directly", "description": "Federico has been a great addition to our team, providing a wide range of fullstack capabilities that are driving major improvements to our corporate site. I thoroughly enjoy working with Federico, something that has been very easy given his strong ability to track priorities, provide recommendations, and deliver on-time.", "authorFullname": "Will Bartlett", "authorUrl": "https://www.linkedin.com/in/willabartlett"}, {"caption": "March 20, 2023, John was Federico’s client", "description": "We hired Federico 3 years ago and he is someone we trust and always go to. Federico is always fast in his response and goes above and beyond for us. We consider Federico a critical part to our team and highly recommend him. It’s been 3 years and we look forward to his help, responsiveness, and expertise as we continue to grow. Thank you Federico!", "authorFullname": "John Spellman", "authorUrl": "https://www.linkedin.com/in/john-spellman-800b4329"}, {"caption": "February 6, 2023, Wendy managed Federico directly", "description": "I have the pleasure of working with Federico since 2016. He is just an excellent and task-oriented individual who is always seeking ways of improving his contribution to the company, always available, and a solution-driven person.\n\nFederico has been a loyal and super talented web and code developer. I cannot recommend him enough.", "authorFullname": "Wendy Valdes, M.S, LCAM", "authorUrl": "https://www.linkedin.com/in/wendy-valdes"}, {"caption": "January 30, 2023, John M. was Federico’s client", "description": "I would like to take a moment to explain the professional experience I had working with Federico both in hosting and designing two websites. \n\nFirst and foremost it should be known that I personally find technology and things having to do with websites, emails, and setting them up as something very foreign and difficult. I was referred to Federico from a business partner and could not have been more pleased and at times even blown away. \n\nThroughout the entire process of choosing a name, registering it, planning a website, building it out, and perhaps the most difficult part, maintaining it, Federico has been second to none including major companies I’ve worked with all the way down to local designers and hosting companies.\n\nFederico has an amazing combination of professional and technical prowess while also being able to explain these concepts in simplistic ways, so that a business owner like myself doesn’t get bogged down in details or feel confused or ever felt “left alone”. The thing that stood out the most to me with working with Federico was how quickly he would respond to problems, and no matter how dumb I felt my questions were, Federico answered them all with a jovial and friendly attitude! \n\nI’ve never had a technical problem or any issue with my website being down, not working, or any my email systems being down or not working with him. At any moment that I had any technical difficulties, no matter how minor, Federico was always available the same day to either get on the phone and speak with me or to get on the Internet and fix whatever issues were going on.\n\nIf you’re an entrepreneur like myself and you have a lot of things going on and have very little knowledge about hosting and websites and email there’s not a single person you can find better fit for you than Federico. His amazing intellect in his field mixed with his amazingly down to earth attitude produces a truly best friend mentality and experience. The way he takes care of his clients, has absolutely blown me away, especially at his young age. In fact, even very large large scale websites that I’ve had to consult on, before speaking to those large companies and designers Federico is still the first person I’d call to run things by and he has always been very aware of his limitations of either A. this is something I can help you with directly or B. let me help you find someone else! Never selfish, never greedy. His concept of a “best friend” company has blown me away. It’s been second to none you will not be disappointed working with Federico at any level.\nRespectfully, \nJohn M. Billington IV. ", "authorFullname": "John M. Billington IV", "authorUrl": "https://www.linkedin.com/in/jmorrisbillington4"}]}, "certifications": {"certificationsCount": 1, "certificationHistory": [{"name": "Italian B1", "organizationName": "Società Dante Alighieri", "organizationUrl": "https://www.linkedin.com/company/9346216/", "issuedDate": "Issued Nov 2021"}]}}, "company": {"linkedInId": "8420149", "name": "Hydrostor", "universalName": "hydrostor-inc-", "linkedInUrl": "https://www.linkedin.com/company/8420149", "employeeCount": 105, "followerCount": 23019, "employeeCountRange": {"start": 51, "end": 200}, "websiteUrl": "http://hydrostor.ca", "tagline": "Developing affordable, low impact, emission free #longduration energy storage using compressed air, gravity, and water", "description": "Hydrostor is a leading developer and operator of long-duration energy storage systems. Hydrostor leverages a proven technology solution for delivering long-duration energy storage (eight hours or more) to power grids around the world. Hydrostor’s technology uses compressed air and water to store energy. This patented technology allows grid operators to draw on clean energy, even when there is no sun to fuel solar panels and no wind to generate energy from turbines.\n\nHydrostor has a successful utility scale facility commercially contracted to the Independent Electricity System Operator (IESO) located in Goderich, Ontario, and two advanced projects under development in Kern County, California and New South Wales, Australia. Hydrostor has an extensive early-stage pipeline of projects in North America, Australia and Europe.\n \nFounded in 2010 and with headquarters in Toronto, Canada and offices in Melbourne, Australia and Sacramento, USA, Hydrostor is backed by Goldman Sachs Asset Management, the Canada Pension Plan (CPP) and other forward-thinking institutional investors, providing financial security to commit to top-tier energy projects.", "industry": "Renewable Energy Power Generation", "phone": "+ 1 (416) 548-7880", "specialities": ["Compressed Air Energy Storage", "Bulk Energy Storage", "Flexible Generation", "Surplus Baseload Generation", "Flexible Site Selection"], "headquarter": {"city": "Toronto", "country": "CA", "postalCode": "M5H 2R2", "geographicArea": "Ontario", "street1": "333 Bay St ", "street2": null}, "logo": "https://media.licdn.com/dms/image/v2/C560BAQHP2AaWV4wWhg/company-logo_400_400/company-logo_400_400/0/1630668157561/hydrostor_inc__logo?e=1741219200&v=beta&t=lOuVZfYKTcDUtKCU8xSAzLL2vs55Dt934hHa6GRnt_I", "foundedOn": {"year": 2010}, "fundingData": {"numberOfFundingRounds": 8, "crunchbaseOrganizationUrl": "https://www.crunchbase.com/organization/hydrostor?utm_source=linkedin&utm_medium=referral&utm_campaign=linkedin_companies&utm_content=profile_cta", "lastFundingRound": {"fundingType": "Debt financing", "moneyRaised": {"amount": "25000000", "currencyCode": "USD"}, "fundingRoundUrl": "https://www.crunchbase.com/funding_round/hydrostor-debt-financing--58eeae22?utm_source=linkedin&utm_medium=referral&utm_campaign=linkedin_companies&utm_content=last_funding", "announcedOn": "2022-04-19T00:00:00.000Z", "numberOfOtherInvestors": 0, "investorsUrl": "https://www.crunchbase.com/funding_round/hydrostor-debt-financing--58eeae22?utm_source=linkedin&utm_medium=referral&utm_campaign=linkedin_companies&utm_content=all_investors", "leadInvestors": [{"name": "CPP Investments", "url": "https://www.crunchbase.com/organization/canada-pension-plan-investment-board?utm_source=linkedin&utm_medium=referral&utm_campaign=linkedin_companies&utm_content=investor", "image": "https://media.licdn.com/dms/image/sync/v2/D5638AQGXK6jWSreARA/crunchbase_investor_logo_100/crunchbase_investor_logo_100/0/1732747443378?e=1733454000&v=beta&t=4mF7zSOqyi0q0XccYVrBL2fCpLBAyC9plltyV8vhX2g"}]}}}}}